snlkuharlocal/src/InformationRegisters/ДанныеДляОтправкиПочтовымУведомлением/ДанныеДляОтправкиПочтовымУведомлением.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеДляОтправкиПочтовымУведомлением</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ОписаниеИзменений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияУведомления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ШтрихКоды</types>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>CatalogRef.ТипыРассылок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ВидыНоменклаутры/ВидыНоменклаутры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклаутры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ОсновноеСредство</name>
  </enumValues>
  <enumValues>
    <name>МБП</name>
  </enumValues>
  <enumValues>
    <name>Материал</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>КомпьютернаяТехника</name>
  </enumValues>
  <enumValues>
    <name>РекламаПлатная</name>
  </enumValues>
  <enumValues>
    <name>РекламаБесплатная</name>
  </enumValues>
  <enumValues>
    <name>Упаковка</name>
  </enumValues>
  <enumValues>
    <name>ТМЦнаОтветственномХранении</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/УсловияОплаты/УсловияОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УсловияОплаты</name>
  <enumValues>
    <name>Предоплата</name>
  </enumValues>
  <enumValues>
    <name>Отсрочка</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/Отгружен/Отгружен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Отгружен</name>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Резерв</name>
  </enumValues>
  <enumValues>
    <name>РезервТранзит</name>
    <comment>Резерв транзит</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженТранзит</name>
    <comment>Отгружен на транзит</comment>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СостоянияНакладной/СостоянияНакладной.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияНакладной</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеНаСклад</name>
    <comment>Накладная готова к отправке на склад</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоСкладом</name>
  </enumValues>
  <enumValues>
    <name>ВНаборе</name>
  </enumValues>
  <enumValues>
    <name>Сканирование</name>
  </enumValues>
  <enumValues>
    <name>ГотоваКОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
    <comment>Накладная оприходована складом</comment>
  </enumValues>
  <enumValues>
    <name>ГотоваКПриемке</name>
  </enumValues>
  <enumValues>
    <name>КОтправкеВОфис</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОфисом</name>
  </enumValues>
  <enumValues>
    <name>Доставлена</name>
  </enumValues>
  <enumValues>
    <name>ПринятаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>ОтгруженаНаТранзитныйСклад</name>
    <comment>Накладная приянта на транзитный склад</comment>
  </enumValues>
  <enumValues>
    <name>РезервУпаковки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОплаты</name>
  </enumValues>
  <enumValues>
    <name>ДопОбработка</name>
  </enumValues>
  <enumValues>
    <name>ДоставленаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ВМашине</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеСканирования</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеДопОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПереукладки</name>
  </enumValues>
  <enumValues>
    <name>Переукладка</name>
  </enumValues>
  <enumValues>
    <name>ВЗонеХранения</name>
  </enumValues>
  <enumValues>
    <name>ПроверенаПоОстаткам</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеПаллетирования</name>
  </enumValues>
  <enumValues>
    <name>Паллетирование</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеТермоусадки</name>
  </enumValues>
  <enumValues>
    <name>Термоусадка</name>
  </enumValues>
  <enumValues>
    <name>СформированыЗаданияНабора</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКорректировки</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеКомплектацииЧЗ</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ЗаказКМЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработкиЧЗ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ВводОстатковВзаиморасчетов/ВводОстатковВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводОстатковВзаиморасчетов</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Взаиморасчеты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВал</name>
      <comment>Сумма в валюте договора</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <comment>Сумма в валюте упр. учета</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаЗадолженности</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументЗакрытогоПериода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/ChartsOfCharacteristicTypes/СвойстваОбъектов/СвойстваОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>СвойстваОбъектов</name>
  <comment>(Общ)</comment>
  <type>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ТипыКоробов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.ФР_Коллекции</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.РайоныДоставки</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.Коллекции</types>
    <types>CatalogRef.ФР_ПоловозрастныеПризнаки</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ФР_ВидыНоменклатуры</types>
    <types>CatalogRef.ОтсрочкиПлатежа</types>
    <types>EnumRef.ПериодичностьОтчетов</types>
    <types>CatalogRef.ТипыЦен</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>Boolean</types>
    <types>CatalogRef.ТипыСкидок</types>
    <types>CatalogRef.Цвета</types>
    <types>CatalogRef.Размеры</types>
    <types>CatalogRef.Автомобили</types>
    <types>String</types>
    <types>EnumRef.СостояниеДокументов</types>
    <types>CatalogRef.Регионы</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Подразделения</types>
    <types>CatalogRef.ПричиныРекламаций</types>
    <types>Date</types>
    <types>CatalogRef.ФР_Бренды</types>
    <types>Number</types>
    <types>EnumRef.ПланФакт</types>
    <types>EnumRef.СостоянияОтчетов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ФР_НоменклатурныеГруппы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.АналитикаОтчетов</types>
    <types>CatalogRef.ИБ</types>
    <types>CatalogRef.ВидыОтчетов</types>
    <numberQualifiers>
      <precision>19</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВидПланаПродаж</name>
      <description>Вид плана продаж</description>
      <code>00109</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения</name>
      <description>Вид распределения</description>
      <code>00111</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ВидРаспределения2</name>
      <description>Вид распределения 2</description>
      <code>00217</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейСверки</name>
      <description>Дата последней сверки</description>
      <code>00215</code>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </items>
    <items>
      <name>КонтрольЛимитаЗадолженности</name>
      <description>Контроль лимита задолженности</description>
      <code>00216</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КонтрольПросроченнойЗадолженности</name>
      <description>Контроль просроченной задолженности</description>
      <code>00112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Контрагент</name>
      <description>Основной поставщик</description>
      <code>00110</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>СостояниеДокументов</name>
      <description>Состояние документов</description>
      <code>00214</code>
      <type>
        <types>EnumRef.СостояниеДокументов</types>
      </type>
    </items>
    <items>
      <name>ТоварнаяГруппа</name>
      <description>Товарная группа</description>
      <code>00213</code>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>НазначениеСвойства</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.НазначенияСвойствКатегорийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЧЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

snlkuharlocal/src/CommonModules/Контроль/Module.bsl
#Область Контроль

Функция КонтрольПросроченнойЗадолженности(Накладная) Экспорт
	
	Можно = Истина;
	
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда
		Возврат НЕ Можно;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ВыбКонтрагент = ?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	Запрос.УстановитьПараметр("Контрагент", ВыбКонтрагент);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 5. Не контролировать лимит кредита и просроченную задолженность перед отправкой на склад по контрагентам-маркетплейсам.
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнетМагазины.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	(ИнетМагазины.Контрагент = &Контрагент
	|			ИЛИ ИнетМагазины.Контрагент.Ведущий = &Контрагент)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		ДополнительныеСвойства = Новый Структура;
		ДополнительныеСвойства.Вставить("Объект", Накладная.Ссылка);
		ДополнительныеСвойства.Вставить("ТипРассылки", Справочники.ТипыРассылок.НеКонтролироватьЛимитКредитаИПросроченнуюЗадолженность);
		ДополнительныеСвойства.Вставить("ОписаниеИзменений", Строка(Накладная.Ссылка) + ": Это накладная по контрагенту-маркетплейсу " + Строка(ВыбКонтрагент));
		ДополнительныеСвойства.Вставить("Период", ТекущаяДата());
		РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(ДополнительныеСвойства);
		Возврат Можно;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольПросроченнойЗадолженности);
	//для бесплатной рекламы контроль не нужен
	ТолькоРеклама = Истина;
	Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			ТолькоРеклама = Ложь;	
		КонецЕсли;
	КонецЦикла;
	Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	
	ЛимитКредитаДоговораНакладной = 0;
	РеквизитыШапки=ПолучитьРеквизитыШапки(Накладная,"Договор,Договор.РезультатПроверкиСБ,Договор.РезультатПроверкиСБ.ОтгружатьПоПредоплате");	
	ТекущийДоговор=РеквизитыШапки.Договор;
	РезультатПроверки=РеквизитыШапки.Договор_РезультатПроверкиСБ;
	ОтгружатьТолькоПоПредоплате=РеквизитыШапки.Договор_РезультатПроверкиСБ_ОтгружатьПоПредоплате;
	ДопустимаяПросрочкаВДнях=30;
	
	УсловияОплаты = Неопределено;
	
	ПросроченнаяЗадолженность=0;
	ПросроченнаяЗадолженностьТекДоговора=0;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(т1.НепрОтгр) КАК НепрОтгр,
	|	СУММА(т1.ДолгКон) КАК ДолгКон,
	|	т1.Договор КАК Договор,
	|	МАКСИМУМ(т1.Договор.УсловияОплаты) КАК УсловияОплаты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА Взаиморасчеты.СуммаВал
	|			ИНАЧЕ -Взаиморасчеты.СуммаВал
	|		КОНЕЦ КАК НепрОтгр,
	|		0 КАК ДолгКон,
	|		Взаиморасчеты.Договор КАК Договор
	|	ИЗ
	|		РегистрНакопления.Взаиморасчеты КАК Взаиморасчеты
	|	ГДЕ
	|		Взаиморасчеты.Период <= &ДатаКонтроля
	|		И КОНЕЦПЕРИОДА(Взаиморасчеты.Регистратор.ДатаОплаты, ДЕНЬ) >= &ДатаКонтроля
	|		И (Взаиморасчеты.Регистратор ССЫЛКА Документ.РасходнаяНакладная
	|				ИЛИ Взаиморасчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов)
	|		И Взаиморасчеты.Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|		И Взаиморасчеты.Контрагент = &Контрагент
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		0,
	|		ЕСТЬNULL(ВзаиморасчетыОстаткиИОбороты.СуммаВалКонечныйОстаток, 0),
	|		ВзаиморасчетыОстаткиИОбороты.Договор
	|	ИЗ
	|		РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(
	|				,
	|				&ДатаКонтроля,
	|				Период,
	|				,
	|				Контрагент = &Контрагент
	|					И Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)) КАК ВзаиморасчетыОстаткиИОбороты) КАК т1
	|
	|СГРУППИРОВАТЬ ПО
	|	т1.Договор";					  
	             
	ДатаКонтроля = КонецДня(ТекущаяДата())-24*60*60*Константы.ЛьготныхДнейКонтроляПросроченнойЗадолженноси.Получить();
	
	Запрос.УстановитьПараметр("ДатаКонтроля", ДатаКонтроля);
	
	УстановитьПривилегированныйРежим(Истина);
	ТЗ = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для каждого Выборка из ТЗ Цикл
		Если Выборка.Договор=ТекущийДоговор тогда
			ПросроченнаяЗадолженностьТекДоговора=ПросроченнаяЗадолженностьТекДоговора+Выборка.ДолгКон-Выборка.НепрОтгр;
		Иначе
			Если (Выборка.ДолгКон-Выборка.НепрОтгр)> 0 Тогда
				Сообщить("Имеется просроченная задолженность по договору " + Выборка.договор);
			КонецЕсли;		
		КонецЕсли;
		
		УсловияОплаты = Выборка.УсловияОплаты;
	КонецЦикла;	
	
	ПросроченнаяЗадолженность = Макс(0,ТЗ.Итог("ДолгКон")-ТЗ.Итог("НепрОтгр"));
	
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 2. При контроле просроченной задолженности в момент отправки на склад РНК по договорам с условиями
	// оплаты «предоплата» и лимитом кредита, равным 0 не считать задолженность до 3 банковских дней
	// препятствием для отправки РНК на склад
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если УсловияОплаты <> Неопределено Тогда
		Если  УсловияОплаты = Перечисления.УсловияОплаты.Предоплата И ПросроченнаяЗадолженность >= 0 Тогда
			ДополнительныеСвойства = Новый Структура;
			ДополнительныеСвойства.Вставить("Объект", Накладная.Ссылка);
			ДополнительныеСвойства.Вставить("ТипРассылки", Справочники.ТипыРассылок.НеКонтролироватьЛимитКредитаИПросроченнуюЗадолженность);
			ДополнительныеСвойства.Вставить("ОписаниеИзменений", Строка(Накладная.Ссылка) + ": Это накладная с условием оплаты Предоплата " + Строка(УсловияОплаты));
			ДополнительныеСвойства.Вставить("Период", ТекущаяДата());
			РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(ДополнительныеСвойства);
			Возврат Можно;
		КонецЕсли;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ПросроченнаяЗадолженность>0 Тогда
		Можно=Накладная.ОтгружатьСПросроченнойЗадолженостью;
		
		Сообщить("На "+ДатаКонтроля+" просроченная задолженность 
		|по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+") 
		|составляет: "+Формат(ПросроченнаяЗадолженность,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+".
		|"+?(НЕ Можно,"Недостаточно полномочий для отправки накладной на склад !",""));		
	КонецЕсли; 
	
	Если ПросроченнаяЗадолженностьТекДоговора>0 Тогда
		Можно=Накладная.ОтгружатьСПросроченнойЗадолженостью;	
		Сообщить("На "+ДатаКонтроля+" просроченная задолженность 
		|по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+") 
		|составляет: "+Формат(ПросроченнаяЗадолженностьТекДоговора,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+".
		|"+?(НЕ Можно,"Недостаточно полномочий для отправки накладной на склад !",""));		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДатаКонтроля", ТекущаяДата()-30*24*3600);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для каждого СтрТЗ из Результат Цикл 
		Если СтрТЗ.договор <> ТекущийДоговор Тогда
				
			Сумма=СтрТЗ.ДолгКон-СтрТЗ.НепрОтгр;
			Если Сумма>0 тогда			
				// Если 30 дней назад просрочка была, а сейчас её нет, то писать о ней наверное бессмысленно.
				СтрТЗДатаНакладной=ТЗ.Найти(СтрТЗ.Договор,"Договор"); 
				Если СтрТЗДатаНакладной=Неопределено или  (СтрТЗДатаНакладной.ДолгКон-СтрТЗДатаНакладной.НепрОтгр)<=0 тогда
					Продолжить;;
				КонецЕсли;
				
				Сообщить("По договору "+СтрТЗ.Договор+" просрочка превысила 30 дней отгрузка запрещена.");  
				Можно = Накладная.ОтгружатьСПросроченнойЗадолженостью;
			КонецЕсли; 
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Можно;
	
КонецФункции // КонтрольПросроченнойЗадолженности(Ссылка)

Функция КонтрольЛимитаКредита(Накладная) Экспорт
	
	Можно = Истина;
	
	Если НЕ ЗначениеЗаполнено(Накладная) Тогда
		Возврат НЕ Можно;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Накладная", Накладная);		
	
	ВыбКонтрагент = ?(ЗначениеЗаполнено(Накладная.Контрагент.Ведущий),Накладная.Контрагент.Ведущий,Накладная.Контрагент);
	Запрос.УстановитьПараметр("Контрагент", ВыбКонтрагент);
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 5. Не контролировать лимит кредита и просроченную задолженность перед отправкой на склад по контрагентам-маркетплейсам.
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнетМагазины.Контрагент КАК Контрагент
	|ИЗ
	|	Справочник.ИнетМагазины КАК ИнетМагазины
	|ГДЕ
	|	(ИнетМагазины.Контрагент = &Контрагент
	|			ИЛИ ИнетМагазины.Контрагент.Ведущий = &Контрагент)";
	
	УстановитьПривилегированныйРежим(Истина);
	Рез = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ Рез.Пустой() Тогда
		ДополнительныеСвойства = Новый Структура;
		ДополнительныеСвойства.Вставить("Объект", Накладная.Ссылка);
		ДополнительныеСвойства.Вставить("ТипРассылки", Справочники.ТипыРассылок.НеКонтролироватьЛимитКредитаИПросроченнуюЗадолженность);
		ДополнительныеСвойства.Вставить("ОписаниеИзменений", Строка(Накладная.Ссылка) + ": Это накладная по контрагенту-маркетплейсу " + Строка(ВыбКонтрагент));
		ДополнительныеСвойства.Вставить("Период", ТекущаяДата());
		РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(ДополнительныеСвойства);
		Возврат Можно;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	ЕстьКонтроль=ПолучитьГрупповоеСвойствоОбъекта(ВыбКонтрагент,ПланыВидовХарактеристик.СвойстваОбъектов.КонтрольЛимитаЗадолженности);
	//для бесплатной рекламы контроль не нужен
	ТолькоРеклама = Истина;
	Для Каждого СтрокаТЧ Из Накладная.Товары Цикл
		Если СтрокаТЧ.Номенклатура.Родитель.ВидНоменклатуры <> Перечисления.ВидыНоменклаутры.РекламаБесплатная Тогда
			ТолькоРеклама = Ложь;	
		КонецЕсли;
	КонецЦикла;
	Если ЕстьКонтроль=Неопределено ИЛИ ЕстьКонтроль=Ложь ИЛИ ТолькоРеклама Тогда Возврат Истина КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК Договор,
	|	Договоры.КодЦБ КАК КодЦБ,
	|	Договоры.ВалютаКредита КАК ВалютаРасчетов,
	|	СУММА(Договоры.ЛимитКредита) КАК ЛимитКредита,
	|	МАКСИМУМ(Договоры.УсловияОплаты) КАК УсловияОплаты,
	|	СУММА(ВЫБОР
	|			КОГДА Договоры.ДопСоглашение
	|				ТОГДА Договоры.ЛимитКредита
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЛимитКредитаПоДопСоглашению
	|ИЗ
	|	Справочник.Договоры КАК Договоры
	|ГДЕ
	|	Договоры.КодЦБ = &КодЦБ
	|	И Договоры.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И НЕ Договоры.ПометкаУдаления
	|	И НЕ Договоры.НеИспользовать
	|
	|СГРУППИРОВАТЬ ПО
	|	Договоры.КодЦБ,
	|	Договоры.ВалютаКредита,
	|	Договоры.Ссылка";	
	
	Запрос.УстановитьПараметр("КодЦБ", ВыбКонтрагент.Код);
	
	ДатаКонтроля = КонецДня(ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
	
	ВалютаИтогов=ПараметрыСеанса.ВалютаУпр_2009;
	
	ЛимитКредита	= 0;
	ЛимитКредитаПоДопСоглашению = 0;
	
	УсловияОплаты = Неопределено;
	
	// Кухарь А.Ю.  18.04.2023 начало
	// Контроль договоров СБ
	ЛимитКредитаДоговораНакладной = 0;
	РеквизитыШапки=ПолучитьРеквизитыШапки(Накладная,"Договор,Договор.РезультатПроверкиСБ,Договор.РезультатПроверкиСБ.ОтгружатьПоПредоплате");	
	ТекущийДоговор=РеквизитыШапки.Договор;
	РезультатПроверки=РеквизитыШапки.Договор_РезультатПроверкиСБ;
	ОтгружатьТолькоПоПредоплате=РеквизитыШапки.Договор_РезультатПроверкиСБ_ОтгружатьПоПредоплате;	
	// Кухарь А.Ю.  18.04.2023 конец
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		// Кухарь А.Ю.  18.04.2023 начало
		Если Выборка.Договор = ТекущийДоговор тогда
			ЛимитКредитаДоговораНакладной=ЛимитКредитаДоговораНакладной+глПересчет(Выборка.ЛимитКредита,Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
		КонецЕсли;
		// Кухарь А.Ю.  18.04.2023 конец
		ЛимитКредита	= ЛимитКредита + глПересчет(Выборка.ЛимитКредита, Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
		ЛимитКредитаПоДопСоглашению = ЛимитКредитаПоДопСоглашению + глПересчет(Выборка.ЛимитКредитаПоДопСоглашению, Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
		
		УсловияОплаты = Выборка.УсловияОплаты;
	КонецЦикла;
	
	//////////////////////////////////////////////////////////////////////////////////////////////
	// 1. Не контролировать лимит кредита в момент отправки на склад РНК по договорам с условиями
	//    оплаты «предоплата» и лимитом кредита, равным 0.
	//////////////////////////////////////////////////////////////////////////////////////////////
	Если УсловияОплаты <> Неопределено Тогда
		Если УсловияОплаты = Перечисления.УсловияОплаты.Предоплата И ЛимитКредита = 0 Тогда
			ДополнительныеСвойства = Новый Структура;
			ДополнительныеСвойства.Вставить("Объект", Накладная.Ссылка);
			ДополнительныеСвойства.Вставить("ТипРассылки", Справочники.ТипыРассылок.НеКонтролироватьЛимитКредитаИПросроченнуюЗадолженность);
			ДополнительныеСвойства.Вставить("ОписаниеИзменений", Строка(Накладная.Ссылка) + ": Это накладная с условием оплаты Предоплата " + Строка(УсловияОплаты));
			ДополнительныеСвойства.Вставить("Период", ТекущаяДата());
			РегистрыСведений.ДанныеДляОтправкиПочтовымУведомлением.СоздатьЗаписьДляОтправкиПочтовымСообщением(ДополнительныеСвойства);
			Возврат Можно;
		КонецЕсли;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////////////////////////
	
	// Контроль договоров СБ
	Если ОтгружатьТолькоПоПредоплате=Истина тогда
		ЛимитКредитаДоговораНакладной=0;
	КонецЕсли;	  
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыОстатки.Договор КАК Договор,
	|	ВзаиморасчетыОстатки.Договор.ВалютаКредита КАК ВалютаРасчетов,
	|	ВзаиморасчетыОстатки.СуммаВалОстаток КАК ОбщийДолг,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыОстатки.Договор.ДопСоглашение
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * ВзаиморасчетыОстатки.СуммаВалОстаток КАК ДолгПоДопСоглашению
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(
	|			&ДатаКонтроля,
	|			Контрагент = &Контрагент
	|				И Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)) КАК ВзаиморасчетыОстатки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходнаяНакладная.Договор,
	|	РасходнаяНакладная.Договор.ВалютаКредита,
	|	РасходнаяНакладная.СуммаДокумента,
	|	ВЫБОР
	|		КОГДА РасходнаяНакладная.Договор.ДопСоглашение
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ * РасходнаяНакладная.СуммаДокумента
	|ИЗ
	|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
	|ГДЕ
	|	РасходнаяНакладная.Проведен
	|	И РасходнаяНакладная.Отгружен = ЗНАЧЕНИЕ(Перечисление.Отгружен.Резерв)
	|	И РасходнаяНакладная.Договор.ВидДоговора_Новый = ЗНАЧЕНИЕ(Справочник.ВидыДоговоров.Товары_Продажа)
	|	И (РасходнаяНакладная.СостояниеНакладной <> ЗНАЧЕНИЕ(Перечисление.СостоянияНакладной.ВРаботе)
	|			ИЛИ РасходнаяНакладная.Ссылка = &Накладная)
	|	И (РасходнаяНакладная.Контрагент.Ведущий = &Контрагент
	|			ИЛИ РасходнаяНакладная.Контрагент = &Контрагент)";
	
	ОбщийДолг=0;
	ДолгПоДопСоглашению=0;
	ДолгПоДоговоруНакладной=0;	
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка=Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Пока Выборка.Следующий() Цикл
		если Выборка.Договор=ТекущийДоговор тогда
			ДолгПоДоговоруНакладной = ДолгПоДоговоруНакладной + глПересчет(Выборка.ОбщийДолг, Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);	
		КонецЕсли;
		
		ОбщийДолг = ОбщийДолг + глПересчет(Выборка.ОбщийДолг, Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);			
		ДолгПоДопСоглашению	=ДолгПоДопСоглашению+глПересчет(Выборка.ДолгПоДопСоглашению,Выборка.ВалютаРасчетов,ДатаКонтроля,ВалютаИтогов,ДатаКонтроля);
	КонецЦикла; 
	
	Если ОбщийДолг > ЛимитКредита Тогда
		
		Можно = Накладная.ОтгружатьСПревышениемЛимитаКредита;
		
		Сообщить("На "+ДатаКонтроля+" задолженность 
		|по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+")
		|составляет: "+Формат(ОбщийДолг,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Доступный лимит: "+Формат(ЛимитКредита,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Лимит превышен на : "+Формат((ОбщийДолг-ЛимитКредита),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|"+?(НЕ Можно,"
		|Недостаточно полномочий для отправки накладной на склад !",""));		
		
	ИначеЕсли ДолгПоДопСоглашению>ЛимитКредитаПоДопСоглашению И Накладная.Договор.ДопСоглашение И Накладная.Дата>='20091001' Тогда
		
		Можно = Накладная.ОтгружатьСПревышениемЛимитаКредита;
		
		Сообщить("На "+ДатаКонтроля+" задолженность по доп. соглашению
		|по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+")
		|составляет: "+Формат(ДолгПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Доступный лимит по доп. соглашению: "+Формат(ЛимитКредитаПоДопСоглашению,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Лимит превышен на : "+Формат((ДолгПоДопСоглашению-ЛимитКредитаПоДопСоглашению),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|"+?(НЕ Можно,"
		|Недостаточно полномочий для отправки накладной на склад !",""));
		
	ИначеЕсли ДолгПоДоговоруНакладной>ЛимитКредитаДоговораНакладной Тогда
		
		Можно = Накладная.ОтгружатьСПревышениемЛимитаКредита;
		
		Сообщить("На "+ДатаКонтроля+" задолженность по договору накладной
		|по контрагенту """+СокрЛП(ВыбКонтрагент)+""" ("+СокрЛП(ВыбКонтрагент.Код)+")
		|составляет: "+Формат(ДолгПоДоговоруНакладной,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Доступный лимит по договору накладной: "+Формат(ЛимитКредитаДоговораНакладной,"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|Лимит превышен на : "+Формат((ДолгПоДоговоруНакладной-ЛимитКредитаДоговораНакладной),"ЧДЦ=2; ЧРГ=' '; ЧГ=3,0")+" "+ВалютаИтогов+".
		|"+?(НЕ Можно,"
		|Недостаточно полномочий для отправки накладной на склад !",""));		 
		
	КонецЕсли; 
	
	Возврат Можно;
	
КонецФункции

#КонецОбласти
